-- #1 --
select "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД", "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
from "Н_ТИПЫ_ВЕДОМОСТЕЙ"
join "Н_ВЕДОМОСТИ" on "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД" = "Н_ВЕДОМОСТИ"."ВЕД_ИД"
where "Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ" > 'Ведомость' and "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 163249 and "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" > 142390;

-- #2 --
select "Н_ЛЮДИ"."ИМЯ", "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД", "Н_УЧЕНИКИ"."НАЧАЛО"
from "Н_ЛЮДИ"
right join "Н_ОБУЧЕНИЯ" on "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
right join "Н_УЧЕНИКИ" on "Н_ОБУЧЕНИЯ"."ВИД_ОБУЧ_ИД" = "Н_УЧЕНИКИ"."ИД"
where "Н_ЛЮДИ"."ОТЧЕСТВО" > 'Сергеевич' and "Н_ОБУЧЕНИЯ"."НЗК" < '933232';

-- #3 --
select case when count(*) > 0 then 'Среди студентов вечерней формы обучения есть люди без ИНН.' -- Такой студент 1 --
    else 'Среди студентов вечерней формы обучения есть люди без ИНН.' end as результат
from "Н_ФОРМЫ_ОБУЧЕНИЯ" ф
join "Н_ПЛАНЫ" п on ф."ИД" = п."ФО_ИД"
join "Н_УЧЕНИКИ" у on п."ИД" = у."ПЛАН_ИД"
join "Н_ОБУЧЕНИЯ" о on у."ИД" = о."ЧЛВК_ИД"
join "Н_ЛЮДИ" л on о."ЧЛВК_ИД" = л."ИД"
where ф."НАИМЕНОВАНИЕ" = 'Очно-заочная(вечерняя)'
and л."ИНН" is null;

-- for tests --
select * from "Н_УЧЕНИКИ";
select * from "Н_ОБУЧЕНИЯ";
select * from "Н_ЛЮДИ";
select * from "Н_ФОРМЫ_ОБУЧЕНИЯ";
select * from "Н_ПЛАНЫ";