-- #1 --
select "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД", "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
from "Н_ТИПЫ_ВЕДОМОСТЕЙ"
join "Н_ВЕДОМОСТИ" on "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД" = "Н_ВЕДОМОСТИ"."ВЕД_ИД"
where "Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ" > 'Ведомость' and "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 163249 and "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" > 142390;


-- #2 --
select "Н_ЛЮДИ"."ИМЯ", "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД", "Н_УЧЕНИКИ"."НАЧАЛО"
from "Н_ЛЮДИ"
right join "Н_ОБУЧЕНИЯ" on "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
right join "Н_УЧЕНИКИ" on "Н_ОБУЧЕНИЯ"."ВИД_ОБУЧ_ИД" = "Н_УЧЕНИКИ"."ИД"
where "Н_ЛЮДИ"."ОТЧЕСТВО" > 'Сергеевич' and "Н_ОБУЧЕНИЯ"."НЗК" < '933232';


-- #3 --
select case when count(*) > 0 then 'Среди студентов вечерней формы обучения есть люди без ИНН.' -- Такой студент 1 --
    else 'Среди студентов вечерней формы обучения есть люди без ИНН.' end as результат
from "Н_ФОРМЫ_ОБУЧЕНИЯ" ф
join "Н_ПЛАНЫ" п on ф."ИД" = п."ФО_ИД"
join "Н_УЧЕНИКИ" у on п."ИД" = у."ПЛАН_ИД"
join "Н_ОБУЧЕНИЯ" о on у."ИД" = о."ЧЛВК_ИД"
join "Н_ЛЮДИ" л on о."ЧЛВК_ИД" = л."ИД"
where ф."НАИМЕНОВАНИЕ" = 'Очно-заочная(вечерняя)'
and л."ИНН" is null;


-- #4 --
select "Н_ЛЮДИ"."ОТЧЕСТВО", count(*) as "Кол-во"
from "Н_ЛЮДИ"
where "Н_ЛЮДИ"."ОТЧЕСТВО" in(
    select "Н_ЛЮДИ"."ОТЧЕСТВО"
    from "Н_ЛЮДИ"
    join "Н_ОБУЧЕНИЯ" on "ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
    join "Н_УЧЕНИКИ" on "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    join "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
    join "Н_ОТДЕЛЫ" on "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
    where "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ'
     group by "Н_ЛЮДИ"."ОТЧЕСТВО"
     having count(*) > 50
    )
group by "Н_ЛЮДИ"."ОТЧЕСТВО";


-- №5 --
with max_score as (
select max(case в."ОЦЕНКА" when 'зачет' then 5 when 'незач' then 2 end) as max_score
from "Н_УЧЕНИКИ" у
inner join "Н_ОБУЧЕНИЯ" о on о."ЧЛВК_ИД" = у."ЧЛВК_ИД"
inner join "Н_ВЕДОМОСТИ" в on в."ЧЛВК_ИД" = о."ЧЛВК_ИД"
where у."ГРУППА" = '3100'
)
select
у."ИД",
concat(л."ФАМИЛИЯ", ' ', л."ИМЯ", ' ', л."ОТЧЕСТВО") AS "ФИО",
avg(case в."ОЦЕНКА" when 'зачет' then 5 when 'незач' then 2 end) as "Ср_оценка"
from "Н_УЧЕНИКИ" у
inner join "Н_ОБУЧЕНИЯ" о on о."ЧЛВК_ИД" = у."ЧЛВК_ИД"
inner join "Н_ЛЮДИ" л on л."ИД" = о."ЧЛВК_ИД"
inner join "Н_ВЕДОМОСТИ" в on в."ЧЛВК_ИД" = л."ИД"
where у."ГРУППА" = '4100'
group by у."ИД", л."ФАМИЛИЯ", л."ИМЯ", л."ОТЧЕСТВО"
having avg(case в."ОЦЕНКА" when 'зачет' then 5 when 'незач' then 2 end) <= (
select max_score.max_score from max_score
)
order by у."ИД";


-- №6 --
-- проверить в 4 лабе с подзапросом и без
select distinct st."ГРУППА", concat(p."ФАМИЛИЯ", ' ', p."ИМЯ", ' ', p."ОТЧЕСТВО") as "ФИО", st."П_ПРКОК_ИД"
from "Н_ЛЮДИ" p inner join "Н_ОБУЧЕНИЯ" ed ON ed."ЧЛВК_ИД"=p."ИД"
                inner join "Н_УЧЕНИКИ" st ON ed."ЧЛВК_ИД"=st."ЧЛВК_ИД"
                inner join "Н_ПЛАНЫ" pl ON pl."ИД"=st."ПЛАН_ИД"
                inner join "Н_ФОРМЫ_ОБУЧЕНИЯ" ef ON pl."ФО_ИД" = ef."ИД"
where p."ИД" in (
    select distinct "ИД"
    from "Н_УЧЕНИКИ" st
    where "ПРИЗНАК" = 'отчисл'
    ) and st."КОГДА_ИЗМЕНИЛ" < '2012-09-01' and ef."НАИМЕНОВАНИЕ" = 'Заочная';


-- №7 --
select с1."ИД", с1."ФАМИЛИЯ", с1."ИМЯ", с2."ИД", с2."ФАМИЛИЯ", с2."ИМЯ"
from "Н_ЛЮДИ" с1
    inner join "Н_ЛЮДИ" с2 on с1."ФАМИЛИЯ" = с2."ФАМИЛИЯ" and с1."ИД" <> с2."ИД"
order by с1."ФАМИЛИЯ";



-------EXTRA---------
--#1--
-------------------------------------------------------------------------------------------
--                 ↓ ↓ ↓    вот это вроде работает правильно    ↓ ↓ ↓                    --
-------------------------------------------------------------------------------------------

select
uch."ГРУППА",
count(distinct case when ved."ОЦЕНКА" = '5' then uch."ЧЛВК_ИД" end) as "Отличники",
count(distinct case when EXISTS (
select 1 from "Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК"
where "ИД" = ved."СЭС_ИД" and "ОЦЕНКА" <> '5'
) then uch."ЧЛВК_ИД" end) as "Двоечники"
from "Н_УЧЕНИКИ" uch
join "Н_ВЕДОМОСТИ" ved on (uch."ЧЛВК_ИД"=ved."ЧЛВК_ИД")
join "Н_СОДЕРЖАНИЯ_ЭЛЕМЕНТОВ_СТРОК" ses on (ved."СЭС_ИД"=ses."ИД")
join "Н_ЭЛЕМЕНТЫ_СТРОК" es on (ses."ЭСТ_ИД" = es."ИД")
join "Н_СТРОКИ_ПЛАНОВ" plan on (es."СПЛ_ИД" = plan."ИД")
group by uch."ГРУППА";



-- for tests --
select * from "Н_УЧЕНИКИ";
select * from "Н_ОБУЧЕНИЯ";
select * from "Н_ЛЮДИ";
select * from "Н_ФОРМЫ_ОБУЧЕНИЯ";
select * from "Н_КВАЛИФИКАЦИИ";
select * from "Н_ПЛАНЫ";
select * from "Н_ОТДЕЛЫ";
select * from "Н_ВЕДОМОСТИ";